In [6]:
import pandas as pd
import numpy as np

In [7]:
print(pd.__version__)

2.1.4

In [18]:
s = pd.Series()
print(s)

Series([], dtype: object)

In [22]:
a = pd.Series([10,11,12,13,14,15,16],index=("Row1","Row2","Row3","Row4","Row5","Row6","Row7"))
print(a)

Row1    10
Row2    11
Row3    12
Row4    13
Row5    14
Row6    15
Row7    16
dtype: int64

In [31]:
a = [9,8,7,6,5,4]

srs = pd.Series(a,range(1,(len(a))+1))

In [32]:
srs

1    9
2    8
3    7
4    6
5    5
6    4
dtype: int64

In [41]:
import pandas as pd
import numpy as np
data = {'a' : 0, 'b' : 1, 'c' : 2}
s = pd.Series(data,index=["b","c","d","a"])
print(s)

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [47]:
s = pd.Series("s", index=[0,1,2,3])
s

0    s
1    s
2    s
3    s
dtype: object

In [48]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
print(s)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [52]:
print(s.iloc[0])

1

In [53]:
print(s[:3])

a    1
b    2
c    3
dtype: int64

In [54]:
print(s[::2])

a    1
c    3
e    5
dtype: int64

In [57]:
print(s[-3:])

c    3
d    4
e    5
dtype: int64

In [58]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
print(s)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [59]:
s["f"] = 6

In [60]:
s

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [67]:
print(s[['a','b']])

a    1
b    2
dtype: int64

In [71]:
print(s["e":"a":-1])

e    5
d    4
c    3
b    2
a    1
dtype: int64

In [72]:
df = pd.DataFrame()

In [73]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [81]:
data = [1,2,3,4,5]
df = pd.DataFrame(data,index=["a","b","c","d","e"],columns=["Name"])
print(df)

   Name
a     1
b     2
c     3
d     4
e     5

In [91]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
print(df)

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [92]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [93]:
df["Age"] = df["Age"].astype(float)

In [94]:
df

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [105]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print (df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [106]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
print (df)

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [108]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
print(df)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [ ]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df1 = pd.DataFrame(data, index=['first', 'second'],columns=["a","b"])
print(df)

        a   b
first   1   2
second  5  10

In [112]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]

#With two column indices, values same as dictionary keys
df1 = pd.DataFrame(data, index=['first', 'second'],
columns=['a', 'b'])

In [113]:
#With two column indices with one index with other name
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b1'])
print (df1)
print (df2)

        a   b
first   1   2
second  5  10
        a  b1
first   1 NaN
second  5 NaN

In [114]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
print(df)
print (df['one'])
print (df[['one','two']])

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4
a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64
   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [ ]:
# Creating a DataFrame from a list of lists
data_list = [['Alex', 10, 'New York'], ['Bob', 12, 'Los Angeles'], ['Clarke', 13, 'Chicago']]
df_from_list = pd.DataFrame(data_list)
print("\nDataFrame from list of lists:")
print(df_from_list)

DataFrame from list of lists:
        0   1            2
0    Alex  10     New York
1     Bob  12  Los Angeles
2  Clarke  13      Chicago

In [116]:
# Assuming there's a CSV file named 'data.csv' with appropriate data
# df_from_csv = pd.read_csv('data.csv')
# print("\nDataFrame from CSV file:")
# print(df_from_csv)

# For demonstration, we will create a similar DataFrame manually.
data_csv = {
    'Name': ['Alex', 'Bob', 'Clarke'],
    'Age': [10, 12, 13],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df_from_csv = pd.DataFrame(data_csv)
print("\nDataFrame simulating CSV input:")
print(df_from_csv)

DataFrame simulating CSV input:
     Name  Age         City
0    Alex   10     New York
1     Bob   12  Los Angeles
2  Clarke   13      Chicago

In [117]:
import numpy as np

# Creating a DataFrame from a NumPy array
data_array = np.array([[1, 2, 3], [4, 5, 6]])
df_from_array = pd.DataFrame(data_array, columns=['Column1', 'Column2', 'Column3'])
print("\nDataFrame from NumPy array:")
print(df_from_array)

DataFrame from NumPy array:
   Column1  Column2  Column3
0        1        2        3
1        4        5        6

In [118]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [123]:
df["Three"] = pd.Series((4,5,6,7),index=["a","b","c","d"])

In [124]:
df

   one  two  Three
a  1.0    1      4
b  2.0    2      5
c  3.0    3      6
d  NaN    4      7

In [125]:
df["four"] = df["Three"]+df["two"]

In [126]:
df

   one  two  Three  four
a  1.0    1      4     5
b  2.0    2      5     7
c  3.0    3      6     9
d  NaN    4      7    11

In [127]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']),
   'three' : pd.Series([10,20,30], index=['a','b','c'])}
df = pd.DataFrame(d)
print ("Our dataframe is:")
print(df)

Our dataframe is:
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [128]:
del df["one"]

In [129]:
df

   two  three
a    1   10.0
b    2   20.0
c    3   30.0
d    4    NaN

In [130]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']),
   'three' : pd.Series([10,20,30], index=['a','b','c'])}
df = pd.DataFrame(d)
print ("Our dataframe is:")
print(df)

Our dataframe is:
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [131]:
df.pop('two')

a    1
b    2
c    3
d    4
Name: two, dtype: int64

In [132]:
df

   one  three
a  1.0   10.0
b  2.0   20.0
c  3.0   30.0
d  NaN    NaN

In [137]:
df.drop(columns="three")

   one
a  1.0
b  2.0
c  3.0
d  NaN

In [138]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']),
   'three' : pd.Series([10,20,30], index=['a','b','c'])}
df = pd.DataFrame(d)
print ("Our dataframe is:")
print(df)

Our dataframe is:
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [144]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
print(df)
print(df.loc["a"])

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4
one    1.0
two    1.0
Name: a, dtype: float64

In [145]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
print(df)
print(df.iloc[2])

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4
one    3.0
two    3.0
Name: c, dtype: float64

In [146]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']),
   'three' : pd.Series([10,20,30], index=['a','b','c'])}
df = pd.DataFrame(d)
print ("Our dataframe is:")
print(df)

Our dataframe is:
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [157]:
df.loc["b":"c","one":"two"]

   one  two
b  2.0    2
c  3.0    3

In [160]:
df.loc["b","two"]

2

In [185]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])
print("df")
print(df)
print("df2")
print(df2)

df3 = pd.concat([df,df2])

df
   a  b
0  1  2
1  3  4
df2
   a  b
0  5  6
1  7  8

In [186]:
df3.reset_index(inplace=True)

In [187]:
df3

   index  a  b
0      0  1  2
1      1  3  4
2      0  5  6
3      1  7  8

In [190]:
df3.drop(0,inplace=True)

In [194]:
df3.drop("index",axis=1,inplace=True)
df3

   a  b
1  3  4
2  5  6
3  7  8

In [183]:
df3.pop("index")

0    0
1    1
2    0
3    1
Name: index, dtype: int64

In [184]:
df3

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [200]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Name': ['Alex', 'Bob', 'Clarke', 'David'],
    'Age': [10, 12, 13, 14],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}
df = pd.DataFrame(data)

# Display the original DataFrame
print("Original DataFrame:")
print(df)

# Dropping a row by index label
df_dropped_row = df.drop(1)  # Dropping row with index 1 (Bob)

# Display the DataFrame after dropping the row
print("\nDataFrame after dropping row with index 1 (Bob):")
print(df_dropped_row)

Original DataFrame:
     Name  Age         City
0    Alex   10     New York
1     Bob   12  Los Angeles
2  Clarke   13      Chicago
3   David   14      Houston

DataFrame after dropping row with index 1 (Bob):
     Name  Age      City
0    Alex   10  New York
2  Clarke   13   Chicago
3   David   14   Houston

In [201]:
df

     Name  Age         City
0    Alex   10     New York
1     Bob   12  Los Angeles
2  Clarke   13      Chicago
3   David   14      Houston

In [202]:
df.drop(columns="Name")

   Age         City
0   10     New York
1   12  Los Angeles
2   13      Chicago
3   14      Houston